app/views/users/show.html.erb

  <div class="col-md-8">
    <% if @user.microposts.any? %>
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]