app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "now i love you"], ["user_id", 1], ["created_at", "2018-07-08 10:33:36.417801"], ["updated_at", "2018-07-08 10:33:36.417801"]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save