app/controllers/users_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def show
    @micropost = @user.microposts.first

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "tuquyet"], ["email", ""], ["created_at", "2018-07-08 10:19:59.060632"], ["updated_at", "2018-07-08 10:19:59.060632"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "test@gmail.com"], ["updated_at", "2018-07-08 10:32:00.271762"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)